-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 03, 2025 at 04:46 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `historyelearning`
--

-- --------------------------------------------------------

--
-- Table structure for table `historical_figures`
--

CREATE TABLE `historical_figures` (
  `figure_id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `image` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `historical_figures`
--

INSERT INTO `historical_figures` (`figure_id`, `name`, `image`, `description`, `created_at`, `updated_at`) VALUES
(1, 'เจ้าพระยาพระเสด็จสุเรนทราธิบดี', '2.png', 'นามเดิมของท่านคือ ม.ร.ว. เปีย มาลากุล เกิดเมื่อ พ.ศ. 2414 เริ่มรับราชการเป็นเสมียนในกรมศึกษาธิการต่อมาได้รับพระราชทานสัญญาบัตรเป็นหลวงไพศาลศิลปศาสตรและได้รับตำแหน่งอธิบดีกรมศึกษาธิการท่านเป็นผู้ที่ได้รับการศึกษาในด้านภาษาไทยมาเป็นอย่างดีมีความรู้แตกฉานและได้แต่งหนังสือไว้หลายเล่มด้วยกันที่รู้จักกันดีคือ“สมบัติผู้ดี”ซึ่งยังประโยชน์แก่กุลบุตรกุลธิดาได้ยึดถือเป็นตำราที่มีคุณค่ามาจนทุกวันนี้ท่านถึงแก่อสัญญกรรมเมื่อวันที่ 14 กุมภาพันธ์ พ.ศ.2459', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(2, 'สมเด็จฯเจ้าฟ้ากรมพระนครสวรรค์วรพินิต', '3.png', 'ทรงเป็นพระราชโอรสในพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวรัชกาลที่ 5 และสมเด็จพระนางเจ้าสุขุมาลศรีประสูติเมื่อวันที่29มิถุนายน พ.ศ.2424 ทรงสำเร็จการศึกษาในวิทยาลัยเสนาธิการแห่งเยอรมนีทรงดำรงตำแหน่งที่สำคัญทางการทหารหลายตำแหน่งเช่นผู้บัญชาการทหารเรือ,สนาธิการกระทรวงทหารเรือเป็นต้นนอกจากนี้ยังทรงพระปรีชาสามารถในงานดนตรีเป็นอย่างมากทรงนิพนธ์เพลงไว้มากมายเช่น วอทซ์ปลื้มจิต,วอทซ์ชุมพล,เพลงสุดเสนาะ,เพลงมหาฤกษ์,เพลงมหาโศก,ซึ่งใช้บรรเลงในงานศพ,ทรงสิ้นพระชนม์เมื่อวันที่ 18 มกราคม พ.ศ. 2487 ขณะทรงประทับอยู่ที่ประเทศชวา', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(3, 'หลวงวิจิตรวาทการ', '4.png', 'นามเดิมของท่านคือ กิมเหลียง วัฒนปดา เกิดเมื่อวันที่ 11 สิงหาคม พ.ศ. 2441 ท่านเป็นผู้ทรงคุณวุฒิและนักปราชญ์ราชทูตที่มีความสามารถท่านหนึ่งของไทยท่านมีความรู้เชี่ยวชาญในศิลปะวิชาการทุกด้านทุกสาขา เช่น การทูต การเมือง การปกครอง การศึกษา ปรัชญา จิตวิทยา ประวัติศาสตร์ สังคม ตลอดจนศิลปะ วรรณคดี และการละคร ผลงานของท่าน เช่น ท่านได้ประพันธ์เพลงปลุกใจ ต้นตระกูลไทย เลือดสุพรรณและท่านยังมีส่วนร่วมที่สำคัญในการสร้างโรงละครแห่งชาติจนสำเร็จ ท่านถึงแก่อสัญญกรรมเมื่อวันที่ 30 มีนาคม พ.ศ. 2505', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(4, 'สมเด็จพระเจ้าบรมวงศ์เธอเจ้าฟ้ากกรมหลวงลพบุรีราเมศร์', '5.png', 'ทรงเป็นพระราชโอรสในพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว รัชกาลที่ 5 และพระวิมาดาเธอฯ พระองค์เจ้าสายสวลีภิรมย์ ประสูติเมื่อวันที่ 17 มีนาคม พ.ศ. 2425 ทรงสำเร็จการศึกษามหาวิทยาลัยเคมบริดจ์ในสาขารัฐศาสตร์การปกครองและวิชาประวัติศาสตร์แล้วเสด็จกลับมารับราชการในตำแหน่งผู้ช่วยปลัดทูลฉลองและเจ้ากรมพลังภังค์ (กรมการปกครอง) ต่อมาทรงดำรงตำแหน่งสมุหเทศาภิบาลและอุปราชมณฑลภาคใต้ในสมัยรัชกาลที่ 6 ทรงตั้งกรมเสือป่ามณฑลนครศรีธรรมราชเพื่อป้องกันรักษาความมั่นคงแห่งราชอาณาจักรจากพวกล่าอาณานิคมทรงดำรงตำแหน่งเสนาบดีกระทรวงมหาดไทยและอภิรัฐมนตรีในสมัยรัชกาลที่ 7 ทรงสิ้นพระชนม์เมื่อวันที่ 8 เมษายน พ.ศ. 2475', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(5, 'พระเจ้าบรมวงศ์เธอ กรมพระนเรศวรวรฤทธิ์', '6.png', 'เป็นพระราชโอรสในพระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว รัชกาลที่ 4 และเจ้าจอมมารดากลิ่น พระนามเดิมว่า พระองค์เจ้ากฤษดาภิหาร ประสูติเมื่อวันที่ 7 พฤษภาคม พ.ศ. 2398 ทรงเป็นต้นราชสกุลกฤษดากร พระองค์ทรงรับราชการในตำแหน่งที่สำคัญทั้งในสมัยรัชกาลที่ 5 และรัชกาลที่ 6 เช่น ทรงดำรงตำแหน่งอัครราชทูตประจำประเทศอังกฤษและสหรัฐฯ ทรงเป็นคอมมิตตีกรมพระนครบาล เป็นเสนาบดีกระทรวงนครบาลและเสนาบดีกระทรวงโยธาธิการในสมัยรัชกาลที่ 5 ทรงดำรงตำแหน่งสมุหมนตรี เสนากระทรวงมุรธาการ และเสนาบดีที่ปรึกษาในสมัยรัชกาลที่ 6 พระองค์สิ้นพระชนม์เมื่อวันที่ 20 สิงหาคม พ.ศ. 2468', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(6, 'เจ้าฟ้าภาณุรังษีสว่างวงศ์กรมพระยาภาณุพันธุวงศ์วรเดช', '7.png', 'ทรงเป็นพระราชโอรสในพระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว รัชกาลที่ 4 และสมเด็จพระเทพศิรินทราบรมราชชนนี ประสูติเมื่อวันที่ 11 มกราคม พ.ศ. 2402 พระนามเดิมว่า สมเด็จเจ้าฟ้าภาณุรังษีสว่างวงศ์ พระองค์ได้ทรงงานสำคัญอันเป็นประโยชน์แก่ประเทศชาติไว้มากมายดังมีเรื่องเล่าเกี่ยวกับพระองค์ท่านว่า พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว รัชกาลที่ 4 และพระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว รัชกาลที่ 7 มีพระราชดำรัสสรรเสริญ “ทรงเป็นหลักเมืองของพระบรมราชวงศ์จักรี” ทรงได้รับตำแหน่งอธิบดีกรมไปรษณีย์และโทรเลขเป็นพระองค์แรกของประเทศไทย ทรงเสด็จทิวงคตเมื่อวันที่ 13 มิถุนายน พ.ศ. 2471', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(7, 'จอมพลเจ้าพระยาสุรศักดิ์มนตรี', '11.jpg', 'นามเดิมของท่านคือ เจิม แสงชูโต เกิดเมื่อ พ.ศ. 2394 ในสมัยรัชกาลที่ 5 ทรงพระกรุณาโปรดเกล้าฯให้จัดตั้งกรมมหาดเล็กรักษาพระองค์ขึ้นเป็นครั้งแรกท่านได้รับการบรรจุเป็นทหารมหาดเล็กรักษาพระองค์เป็นคนแรกมีหน้าที่อารักขาพระเจ้าแผ่นดินขณะออกต้อนรับชาวต่างชาติและออกขุนนางต่อมาท่านได้เลื่อนตำแหน่งจนกระทั่งได้รับตำแหน่ง\"ผู้บัญชาการทหารสูงสุด\"ผลงานของท่านที่ได้รับการกล่าวขานมากที่สุดคือ ท่านเป็นผู้นำเอาไฟฟ้ามาใช้ในเมืองไทยเป็นคนแรกเมื่อ พ.ศ. 2427 ตั้งแต่ยังเป็นหมื่นไวยวรนารถโดยท่านได้นำมาจากกรุงปารีสประเทศฝรั่งเศสจึงได้มีไฟฟ้าใช้กันตั้งแต่นั้นเป็นต้นมา', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(8, 'พระยาศรีสุนทรโวหาร', '12.jpg', 'นามเดิมของท่านคือน้อย อาจารยางกูร เกิดเมื่อวันที่ 5 กรกฎาคม พ.ศ. 2365 ท่านมีผลงานที่เด่นมากในวงการศึกษาท่านเป็นผู้แต่งตำราเรียนชุดแรกของไทย ซึ่งในสมัยนั้น เรียกว่า \"แบบเรียนหลวง\"ใช้สอนในโรงเรียนพระตำหนักสวนกุหลาบ (โรงเรียนหลวงแห่งแรก) และหนังสือกวีนิพนธ์ที่มีคุณค่าอีกหลายเรื่อง งานชิ้นสำคัญชิ้นหนึ่งคือท่านได้รับแต่งตั้งให้เป็น แม่กลองตรวจโคลงบรรยายประกอบรูปภาพเรื่อง\"รามเกียรติ์\"รอบระเบียงพระอุโบสถวัดพระศรีรัตนศาสดารามเมื่อครั้งกรุงรัตนโกสินทร์ครบรอบ 100 ปีและตัวท่านเองก็ได้รับหน้าที่เป็นผู้แต่งด้วยท่านหนึ่งท่านถึงแก่อสัญญกรรมเมื่อวันที่ 16 ตุลาคม พ.ศ. 2434', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(9, 'สมเด็จเจ้าพระยาบรมมหาศรีสุริยวงศ์', '14.png', 'นามเดิมของท่านคือ ช่วง บุนนาค เกิดเมื่อ พ.ศ. 2351 เป็นบุตรของสมเด็จเจ้าพระยามหาประยูรวงศ์และท่านผู้หญิงจันได้เข้าถวายตัวเป็นมหาดเล็กในพระบาทสมเด็จพระพุทธเลิศหล้านภาลัย รัชกาลที่ 2 ต่อมาในสมัยรัชกาลที่ 3 ท่านได้ตามบิดาไปสร้างเมืองจันทบุรีและต่อเรือกำปั่นรบลำแรกขึ้นโดยเลียนแบบมาจากเรือของพวกฝรั่งและนำขึ้นถวายพระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัวและทรงโปรดพระราชทานชื่อให้ว่า “เรือแกล้วกลางสมุทร” ชื่อภาษาอังกฤษว่า อาเรียลเมื่อสิ้นสมัยพระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัวและเจ้าฟ้าจุฬาลงกรณ์ (รัชกาลที่ 5)ทรงขึ้นครองราชย์ ขณะนั้นยังทรงพระเยาว์ท่านได้รับการแต่งตั้งให้เป็นผู้สำเร็จราชการแทนพระองค์ท่านถึงแก่พิราลัยเมื่ออายุได้ 75 ปี', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(10, 'ศาสตราจารย์พระยาอนุมานราชธน', '15.jpg', '(ยง เสถียรโกเศศ) นักปราชญ์และนักวัฒนธรรมสำคัญของไทยยูเนสโกประกาศยกย่องให้เป็นบุคคลสำคัญของโลกผู้มีผลงานดีเด่นด้านวัฒนธรรมระดับโลกเนื่องในโอกาสครบรอบ ชาตกาล 100 ปี เมื่อวันที่ 14 ธันวาคม 2531', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(11, 'สมเด็จพระมหาสมณเจ้า กรมพระปรมานุชิตชิโนรส', '16.png', 'ทรงเป็นพระสงฆ์รูปแรกที่ได้รับการถวายพระเกียรติจากยูเนสโก ประกาศให้เป็นบุคคลผู้มีผลงานดีเด่นด้านวัฒนธรรมระดับโลกเนื่องในวาระฉลองวันประสูติครบ 200 ปีเมื่อวันที่ 11 ธันวาคม 2533', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(12, 'สมเด็จพระมหิตลาธิเบศร อดุลยเดชวิกรม พระบรมราชชนก', '17.png', 'ทรงได้รับการถวายพระสมัญญา “พระบิดาแห่งการแพทย์ไทย” เมื่อปี 2535 ยูเนสโกได้ประกาศยกย่องให้เป็นบุคคลสำคัญของโลกด้านการศึกษา \"วิทยาศาสตร์การแพทย์การพยาบาลและการสาธารณสุข\"เนื่องในวาระฉลองครบรอบ 100 ปีวันคล้ายวันพระราชสมภพ เมื่อวันที่ 1 มกราคม 2535', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(13, 'พลตรี ม.ร.ว.คึกฤทธิ์ ปราโมช', '18.jpg', 'ได้รับการยกย่องจากยูเนสโกให้เป็นบุคคลสำคัญของโลกด้านการศึกษา,วัฒนธรรม,สังคมศาสตร์และสื่อสารมวลชนเนื่องในโอกาสครบรอบชาตกาล 100 ปี ในวันที่ 20 เมษายน 2554 นับเป็นคนไทยลำดับที่ 20 นับเป็นเกียรติประวัติแก่ประเทศไทยอย่างยิ่งอีกครั้งหนึ่ง', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(14, 'สมเด็จพระศรีสวรินทิราบรมราชเทวี พระพันวัสสาอัยยิกาเจ้า', '19.jpg', 'พระองค์ทรงดำรงตำแหน่งองค์สภาชนนีสภาอุณาโลมแดงอันเป็นชื่อแรกของสภากาชาดไทยเมื่อครั้งเริ่มก่อตั้งในต้นรัชกาลที่5เป็นพระองค์แรกและพระองค์เดียวและองค์สภานายิกา สภากาชาดไทย พระองค์ที่ 2 และทรงสร้างสถานพยาบาลขึ้นปัจจุบันคือโรงพยาบาลสมเด็จพระบรมราชเทวีณศรีราชาซึ่งอยู่ภายใต้การดูแลของสภากาชาดไทย', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(15, 'สมเด็จพระเจ้าพี่นางเธอเจ้าฟ้ากัลยาณิวัฒนากรมหลวงนราธิวาสราชนครินทร์', '20.png', 'ได้ทรงบำเพ็ญพระกรณียกิจมากมายแก่ประเทศชาติเพื่อแบ่งเบาพระราชภาระของพระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตรและสมเด็จพระศรีนครินทราบรมราชชนนีมีโครงการในพระอุปถัมภ์หลายร้อยโครงการทั้งด้านการศึกษา,การสังคมสงเคราะห์,การแพทย์และการสาธารณสุข,การต่างประเทศ,การศาสนา และอื่น ๆกับทั้งยังมีพระปรีชาสามารถด้านการเขียน,ด้านการกีฬา,และด้านการถ่ายภาพ', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(16, 'สมเด็จพระนเรศวรมหาราช', '21.jpg', 'สมเด็จพระนเรศวรมหาราช (พ.ศ. 2134-2172) เป็นกษัตริย์แห่งอาณาจักรอยุธยาที่มีชื่อเสียงโด่งดังจากการเป็นผู้มีความสามารถทางการทหารและการเมืองพระองค์ทรงเป็นพระราชโอรสของสมเด็จพระเจ้าอยู่หัวศรีสรรเพชญ์ และทรงพระราชสมภพที่กรุงศรีอยุธยา พระองค์มีบทบาทสำคัญในการรักษาอำนาจอธิปไตยของราชอาณาจักรไทยจากการขยายอำนาจของพม่า', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(17, 'พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว', '22.jpg', 'พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว(พระราชสมภพเมื่อวันที่20กันยายน พ.ศ.2396)หรือที่รู้จักกันในพระนาม\"รัชกาลที่ 5\"ทรงเป็นพระมหากษัตริย์แห่งราชอาณาจักรสยามที่สำคัญที่สุดในยุคสมัยของพระองค์ พระองค์ทรงปกครองประเทศในช่วงระหว่างปี พ.ศ. 2411 ถึง พ.ศ. 2453 และเป็นผู้ที่มีบทบาทสำคัญในการปฏิรูปประเทศและเปิดประเทศให้เข้าสู่ยุคใหม่', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(18, 'พ่อขุนรามคำแหงมหาราช', '23.jpg', 'พ่อขุนรามคำแหงมหาราช (พ.ศ. 1797-1842) เป็นกษัตริย์ของอาณาจักรสุโขทัยและถือเป็นหนึ่งในพระมหากษัตริย์ที่สำคัญที่สุดในประวัติศาสตร์ไทยพระองค์ทรงเป็นผู้ก่อตั้งและขยายอาณาจักรสุโขทัยให้เจริญรุ่งเรืองในช่วงคริสต์ศตวรรษที่13พ่อขุนรามคำแหงทรงมีชื่อเสียงในด้านการปฏิรูปและการพัฒนาระบบการปกครองพระองค์ทรงพัฒนาอาณาจักรสุโขทัยให้มีความเข้มแข็งและทรงส่งเสริมการค้า,การเกษตร,และการพัฒนาอุตสาหกรรมนอกจากนี้พระองค์ยังมีบทบาทสำคัญในการประดิษฐ์ \"อักษรรามคำแหง\" ซึ่งเป็นการประดิษฐ์อักษรไทยที่ใช้อยู่จนถึงปัจจุบัน', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(19, 'สมเด็จพระเจ้าตากสินมหาราช', '24.png', 'พระองค์ทรงพระนามเดิมว่า\"ตากสิน\"พระราชสมภพเมื่อวันที่ 17 เมษายน พ.ศ. 2277 (ตรงกับปี พ.ศ. 2277)เป็นกษัตริย์แห่งราชอาณาจักรธนบุรีในช่วงปลายรัชกาลของกรุงศรีอยุธยาและเป็นผู้ก่อตั้งราชวงศ์ธนบุรีหลังจากกรุงศรีอยุธยาเสียกรุงครั้งที่ 2 เมื่อปี พ.ศ. 2310 สมเด็จพระเจ้าตากสินทรงช่วยปกป้องชาติจากการรุกรานของพม่าจนกรุงศรีอยุธยาตกเป็นเมืองขึ้นของพม่าได้โดยพระองค์ได้รวบรวมทัพและขับไล่พม่าจนสามารถปลดปล่อยกรุงศรีอยุธยาในปี พ.ศ. 2313', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(20, 'พระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช', '25.jpg', 'พระองค์ทรงพระนามเดิมว่า\"สมเด็จพระเจ้ากรุงธนบุรี\"หรือ\"พระบาทสมเด็จพระพุทธยอดฟ้า\"ทรงพระราชสมภพเมื่อวันที่ 20 ตุลาคม พ.ศ. 2325 เป็นพระมหากษัตริย์องค์แรกแห่งราชวงศ์จักรีและทรงมีพระราชกรณียกิจสำคัญในการก่อตั้งกรุงเทพมหานครและการปกครองราชอาณาจักรสมัยใหม่', '2025-02-28 12:34:21', '2025-02-28 12:34:21'),
(21, 'พระบาทสมเด็จพระมหาภูมิพลอดุลยเดชมหาราช', '27.jpg', 'ทรงเป็นพระมหากษัตริย์แห่งราชวงศ์จักรีและทรงครองราชย์ยาวนานที่สุดในประวัติศาสตร์ของประเทศไทยเป็นเวลา 70 ปีทรงได้รับการยกย่องอย่างสูงในฐานะ\"พระราชาผู้ทรงงาน\"และเป็นผู้นำที่สำคัญในการพัฒนาประเทศไทยในหลายด้านพระบาทสมเด็จพระมหาภูมิพลอดุลยเดชทรงเป็นพระมหากษัตริย์ที่ได้รับการเคารพรักอย่างยิ่งจากประชาชนไทยด้วยพระราชกรณียกิจที่หลากหลายและทุ่มเทเพื่อพัฒนาประเทศให้เจริญรุ่งเรืองเเละทรงเป็นที่รักและเคารพในฐานะพระมหากษัตริย์ผู้ทรงมีพระราชอำนาจมากมายในการพัฒนาชาติไทยให้ก้าวหน้าและมั่นคง', '2025-02-28 12:34:21', '2025-02-28 12:34:21');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(50) DEFAULT NULL,
  `role` enum('user','admin') DEFAULT 'user',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_active` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `username`, `email`, `password`, `first_name`, `last_name`, `role`, `created_at`, `updated_at`, `is_active`) VALUES
(1, 'admin1', 'admin1@example.com', 'admin123', 'แอดมิน', 'หนึ่ง', 'admin', '2025-02-28 12:34:21', '2025-02-28 12:34:21', 1),
(2, 'user1', 'user1@example.com', 'user123', 'สมชาย', 'ใจดี', 'user', '2025-02-28 12:34:21', '2025-02-28 12:34:21', 1),
(3, 'nakarin', 'nakarin@gmail.com', 'nakarin123', 'nakarin', 'eiei', 'user', '2025-02-28 15:34:17', '2025-02-28 15:34:17', 1),
(4, 'mik', 'mik@gmail.com', 'mik', 'zin', 'vier', 'user', '2025-02-28 18:11:39', '2025-02-28 18:11:39', 1),
(5, 'nin', 'nin@gmail.com', 'nin', 'nin', 'nin', 'user', '2025-02-28 18:12:20', '2025-02-28 18:12:20', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `historical_figures`
--
ALTER TABLE `historical_figures`
  ADD PRIMARY KEY (`figure_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `historical_figures`
--
ALTER TABLE `historical_figures`
  MODIFY `figure_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
